import React, { useEffect, useRef, useState } from 'react';
import Highcharts from 'highcharts/highstock'
import HighchartsReact from 'highcharts-react-official'
import HighchartsMore from 'highcharts/highcharts-more'
HighchartsMore(Highcharts)

require('highcharts/modules/accessibility')(Highcharts)

export default function FilterStockChart({ data, height, yAxis, getInfo }) {
    const [chartOptions, setChartOptions] = useState({
        chart: {
            type: 'bubble',
            zoomType: 'xy',
            height: height ? height : null, backgroundColor: 'rgba(255, 255, 255, 0)',
            animation: false,
        },
        navigation: { buttonOptions: { enabled: false } }, credits: { enabled: false },
        legend: { enabled: false }, title: { text: null },


        xAxis: [{
            gridLineWidth: 1,
            title: {
                text: null
            },
            labels: {
                style: { color: '#efe9e9ed', fontSize: '11px' }, formatter: function () {
                    var color = this.value > 0 ? '#FCAB2F' : this.value < 0 ? '#00F3FF' : '#efe9e9ed';
                    return `<span style="color: ${color}">${this.value} %</span>`
                }
            },
            gridLineWidth: 0.2,
            tickWidth: 0,
            plotLines: [{
                color: '#efe9e9ed',
                // dashStyle: 'dot',
                width: 0.7,
                value: 0,
                zIndex: 3
            }],
            max: 31,
            opposite: false,
        }, {
            labels: {
                style: { color: '#efe9e9ed', fontSize: '11px' }, formatter: function () {
                    var color = this.value > 0 ? '#FCAB2F' : this.value < 0 ? '#00F3FF' : '#efe9e9ed';
                    return `<span style="color: ${color}">${this.value} %</span>`
                }
            },
            tickWidth: 0,
            opposite: true,
            linkedTo: 0
        }, {
            gridLineWidth: 0,
            labels: {
                style: { color: '#efe9e9ed', fontSize: '11px' },
                formatter: function () {
                    return `${(this.value * 100).toLocaleString('kr')} %`
                }
            },
            tickWidth: 0,
        }],

        yAxis: {
            startOnTick: false,
            endOnTick: false,
            title: {
                text: null
            },
            labels: {
                style: { color: '#efe9e9ed', fontSize: '11px' },
            },
            gridLineWidth: 0.2,
            maxPadding: 0.2,
            reversed: true,
            type: 'category'

        },

        tooltip: {
            formatter: function () {
                return `<b>${this.point.종목명}</b><br/><p>등락률 : ${this.point.x}</p><br/><p>전일대비% : ${parseInt(this.point.전일대비거래량 * 100).toLocaleString('kr')}%</p>`
            },
        },

        plotOptions: {

            bubble: {
                minSize: 13,
                maxSize: 13,
                point: {
                    events: {
                        click: function () {
                            const msg = { 종목코드: this.options.종목코드, 업종명: this.options.업종명, 종목명: this.options.종목명 };
                            getInfo(msg)
                        }
                    }
                }

            },
            series: {
                animation: false,
                // dataLabels: {
                //     enabled: true,
                //     format: '{point.name}'
                // }
            },

        },

    })



    useEffect(() => {
        setChartOptions({
            // series: [
            //     {
            //         data: test_bar_data, xAxis: 2, marker: { symbol: 'cross' }, color: 'red'
            //     },
            //     { data: test_data },],
            series: data,
            yAxis: yAxis
        })
    }, [data, yAxis]);
    return (
        <HighchartsReact
            highcharts={Highcharts}
            options={chartOptions}
        // constructorType={'stockChart'}
        />
    )
}

Highcharts.SVGRenderer.prototype.symbols.cross = function (x, y, w, h) {
    return ["M", x, y, "L", x + w, y + h, "M", x + w, y, "L", x, y + h, "z"];
};
if (Highcharts.VMLRenderer) {
    Highcharts.VMLRenderer.prototype.symbols.cross = Highcharts.SVGRenderer.prototype.symbols.cross;
}

const test_bar_data = [{ 'x': 3.4564913928154164, 'y': 0, 'z': 1 },
{ 'x': 1.0155038192684531, 'y': 1, 'z': 1 },
{ 'x': 0.6383370049555873, 'y': 2, 'z': 1 },
{ 'x': 31.601843823901397, 'y': 3, 'z': 1 },
{ 'x': 0.4925355862745689, 'y': 4, 'z': 1 },
{ 'x': 1.856618638433249, 'y': 5, 'z': 1 },
{ 'x': 0.3777506767599056, 'y': 6, 'z': 1 },
{ 'x': 0.5109729235702409, 'y': 7, 'z': 1 },
{ 'x': 2.5166337400280407, 'y': 8, 'z': 1 },
{ 'x': 1.3911762439176982, 'y': 9, 'z': 1 },
{ 'x': 0.8233773676586216, 'y': 10, 'z': 1 },
{ 'x': 1.4781385698285128, 'y': 11, 'z': 1 },
{ 'x': 0.7302766661055629, 'y': 12, 'z': 1 },
{ 'x': 1.4256224665171104, 'y': 13, 'z': 1 },
{ 'x': 0.9156059058819189, 'y': 14, 'z': 1 },
{ 'x': 9.427495582877544, 'y': 15, 'z': 1 },
{ 'x': 23.460486824444626, 'y': 16, 'z': 1 },
{ 'x': 0.5330237927194413, 'y': 17, 'z': 1 },
{ 'x': 9.801008272706891, 'y': 18, 'z': 1 },
{ 'x': 0.9201504530838639, 'y': 19, 'z': 1 },
{ 'x': 0.8729245896066, 'y': 20, 'z': 1 },
{ 'x': 0.8211206957308238, 'y': 21, 'z': 1 },
{ 'x': 1.2680531390901397, 'y': 22, 'z': 1 },
{ 'x': 0.7861258686306459, 'y': 23, 'z': 1 },
{ 'x': 1.3872673635207058, 'y': 24, 'z': 1 }]


const test_data = [{
    'x': 6.69,
    'y': 0,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '가스유틸리티',
    '종목코드': '036460',
    '종목명': '한국가스공사',
    '전일대비거래량': 1.306194634568484
},
{
    'x': 4.79,
    'y': 0,
    'z': 1,
    'color': 'tomato',
    '업종명': '가스유틸리티',
    '종목코드': '117580',
    '종목명': '대성에너지',
    '전일대비거래량': 8.253382226574209
},
{
    'x': 3.72,
    'y': 0,
    'z': 1,
    'color': 'tomato',
    '업종명': '가스유틸리티',
    '종목코드': '053050',
    '종목명': '지에스이',
    '전일대비거래량': 10.665017338505187
},
{
    'x': 1.69,
    'y': 0,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '가스유틸리티',
    '종목코드': '017940',
    '종목명': 'E1',
    '전일대비거래량': 0.733956216326809
},
{
    'x': 1.43,
    'y': 0,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '가스유틸리티',
    '종목코드': '004690',
    '종목명': '삼천리',
    '전일대비거래량': 0.8216954694068193
},
{
    'x': 0.91,
    'y': 0,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '가스유틸리티',
    '종목코드': '015360',
    '종목명': '예스코홀딩스',
    '전일대비거래량': 1.4533439069521543
},
{
    'x': 0.88,
    'y': 0,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '가스유틸리티',
    '종목코드': '017390',
    '종목명': '서울가스',
    '전일대비거래량': 0.961849957374254
},
{
    'x': 6.26,
    'y': 13,
    'z': 1,
    'color': 'orange',
    '업종명': '건설',
    '종목코드': '012630',
    '종목명': 'HDC',
    '전일대비거래량': 3.5641235465392884
},
{
    'x': 3.41,
    'y': 13,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '건설',
    '종목코드': '028050',
    '종목명': '삼성E&A',
    '전일대비거래량': 1.775192778778607
},
{
    'x': 2.08,
    'y': 13,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '건설',
    '종목코드': '013120',
    '종목명': '동원개발',
    '전일대비거래량': 1.3085775094040784
},
{
    'x': 2.0,
    'y': 13,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '건설',
    '종목코드': '010780',
    '종목명': '아이에스동서',
    '전일대비거래량': 0.9043058181054401
},
{
    'x': 2.0,
    'y': 13,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '건설',
    '종목코드': '186230',
    '종목명': '그린플러스',
    '전일대비거래량': 0.9140619659580286
},
{
    'x': 1.46,
    'y': 13,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '건설',
    '종목코드': '294870',
    '종목명': 'HDC현대산업개발',
    '전일대비거래량': 1.0271684945164508
},
{
    'x': 1.35,
    'y': 13,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '건설',
    '종목코드': '003075',
    '종목명': '코오롱글로벌우',
    '전일대비거래량': 0.4859271523178808
},
{
    'x': 1.35,
    'y': 21,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '건축자재',
    '종목코드': '039020',
    '종목명': '이건홀딩스',
    '전일대비거래량': 0.6933936801893452
},
{
    'x': 0.88,
    'y': 21,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '건축자재',
    '종목코드': '300720',
    '종목명': '한일시멘트',
    '전일대비거래량': 0.5689555683785343
},
{
    'x': 0.86,
    'y': 21,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '건축자재',
    '종목코드': '002380',
    '종목명': 'KCC',
    '전일대비거래량': 0.4089342194107822
},
{
    'x': 0.84,
    'y': 21,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '건축자재',
    '종목코드': '198440',
    '종목명': '고려시멘트',
    '전일대비거래량': 1.1583842309827874
},
{
    'x': 0.73,
    'y': 21,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '건축자재',
    '종목코드': '108675',
    '종목명': 'LX하우시스우',
    '전일대비거래량': 1.1348101265822785
},
{
    'x': 0.51,
    'y': 21,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '건축자재',
    '종목코드': '183190',
    '종목명': '아세아시멘트',
    '전일대비거래량': 0.5606596209912537
},
{
    'x': 0.37,
    'y': 21,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '건축자재',
    '종목코드': '090355',
    '종목명': '노루페인트우',
    '전일대비거래량': 1.222707423580786
},
{
    'x': 3.56,
    'y': 23,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '게임엔터테인먼트',
    '종목코드': '259960',
    '종목명': '크래프톤',
    '전일대비거래량': 0.8990262879241288
},
{
    'x': 0.62,
    'y': 23,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '게임엔터테인먼트',
    '종목코드': '030350',
    '종목명': '드래곤플라이',
    '전일대비거래량': 0.5081887970374497
},
{
    'x': 0.32,
    'y': 23,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '게임엔터테인먼트',
    '종목코드': '194480',
    '종목명': '데브시스터즈',
    '전일대비거래량': 0.9486726565551913
},
{
    'x': 0.12,
    'y': 23,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '게임엔터테인먼트',
    '종목코드': '052790',
    '종목명': '액토즈소프트',
    '전일대비거래량': 1.5415174574753805
},
{
    'x': 0.0,
    'y': 23,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '게임엔터테인먼트',
    '종목코드': '299910',
    '종목명': '베스파',
    '전일대비거래량': 0.0
},
{
    'x': -0.07,
    'y': 23,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '게임엔터테인먼트',
    '종목코드': '060240',
    '종목명': '룽투코리아',
    '전일대비거래량': 0.45470018329405604
},
{
    'x': -0.37,
    'y': 23,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '게임엔터테인먼트',
    '종목코드': '058630',
    '종목명': '엠게임',
    '전일대비거래량': 1.1507756981283155
},
{
    'x': 5.23,
    'y': 19,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '다각화된통신서비스',
    '종목코드': '006490',
    '종목명': '인스코비',
    '전일대비거래량': 1.227446983868596
},
{
    'x': -0.14,
    'y': 19,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '다각화된통신서비스',
    '종목코드': '030200',
    '종목명': 'KT',
    '전일대비거래량': 0.41518544007223857
},
{
    'x': -0.79,
    'y': 19,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '다각화된통신서비스',
    '종목코드': '036630',
    '종목명': '세종텔레콤',
    '전일대비거래량': 1.1178189353107575
},
{
    'x': 11.68,
    'y': 18,
    'z': 1,
    'color': 'tomato',
    '업종명': '디스플레이장비및부품',
    '종목코드': '419080',
    '종목명': '엔젯',
    '전일대비거래량': 57.583388110595294
},
{
    'x': 10.48,
    'y': 18,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '디스플레이장비및부품',
    '종목코드': '371950',
    '종목명': '풍원정밀',
    '전일대비거래량': 1.194282341500501
},
{
    'x': 6.54,
    'y': 18,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '디스플레이장비및부품',
    '종목코드': '110990',
    '종목명': '디아이티',
    '전일대비거래량': 1.7718969691855295
},
{
    'x': 5.57,
    'y': 18,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '디스플레이장비및부품',
    '종목코드': '171090',
    '종목명': '선익시스템',
    '전일대비거래량': 1.1046598701627977
},
{
    'x': 5.0,
    'y': 18,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '디스플레이장비및부품',
    '종목코드': '137940',
    '종목명': '넥스트아이',
    '전일대비거래량': 0.6667026715940761
},
{
    'x': 4.71,
    'y': 18,
    'z': 1,
    'color': 'gold',
    '업종명': '디스플레이장비및부품',
    '종목코드': '177350',
    '종목명': '베셀',
    '전일대비거래량': 2.7259343584932125
},
{
    'x': 2.8,
    'y': 18,
    'z': 1,
    'color': 'orange',
    '업종명': '디스플레이장비및부품',
    '종목코드': '187870',
    '종목명': '디바이스이엔지',
    '전일대비거래량': 3.560193587416818
},
{
    'x': 0.0,
    'y': 20,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '디스플레이패널',
    '종목코드': '121800',
    '종목명': '비덴트',
    '전일대비거래량': 0.0
},
{
    'x': -0.1,
    'y': 20,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '디스플레이패널',
    '종목코드': '034220',
    '종목명': 'LG디스플레이',
    '전일대비거래량': 0.9006089465753142
},
{
    'x': -0.19,
    'y': 20,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '디스플레이패널',
    '종목코드': '020760',
    '종목명': '일진디스플',
    '전일대비거래량': 1.1586172643289958
},
{
    'x': -2.27,
    'y': 20,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '디스플레이패널',
    '종목코드': '052330',
    '종목명': '코텍',
    '전일대비거래량': 1.4324721475220898
},
{
    'x': 0.4,
    'y': 17,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '무선통신서비스',
    '종목코드': '017670',
    '종목명': 'SK텔레콤',
    '전일대비거래량': 0.468200402695595
},
{
    'x': 0.37,
    'y': 17,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '무선통신서비스',
    '종목코드': '065530',
    '종목명': '와이어블',
    '전일대비거래량': 0.566068568813936
},
{
    'x': -0.63,
    'y': 17,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '무선통신서비스',
    '종목코드': '032640',
    '종목명': 'LG유플러스',
    '전일대비거래량': 0.564802406648793
},
{
    'x': 2.4,
    'y': 24,
    'z': 1,
    'color': 'orange',
    '업종명': '방송과엔터테인먼트',
    '종목코드': '066790',
    '종목명': '씨씨에스',
    '전일대비거래량': 3.878309984180736
},
{
    'x': 1.11,
    'y': 24,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '방송과엔터테인먼트',
    '종목코드': '086980',
    '종목명': '쇼박스',
    '전일대비거래량': 1.0838261673860643
},
{
    'x': 0.95,
    'y': 24,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '방송과엔터테인먼트',
    '종목코드': '035760',
    '종목명': 'CJ ENM',
    '전일대비거래량': 0.29522654528986897
},
{
    'x': 0.94,
    'y': 24,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '방송과엔터테인먼트',
    '종목코드': '352820',
    '종목명': '하이브',
    '전일대비거래량': 0.5377572216239754
},
{
    'x': 0.66,
    'y': 24,
    'z': 1,
    'color': 'gold',
    '업종명': '방송과엔터테인먼트',
    '종목코드': '035620',
    '종목명': '바른손이앤에이',
    '전일대비거래량': 2.8339168911119663
},
{
    'x': 0.64,
    'y': 24,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '방송과엔터테인먼트',
    '종목코드': '036420',
    '종목명': '콘텐트리중앙',
    '전일대비거래량': 0.5940323055773763
},
{
    'x': 0.32,
    'y': 24,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '방송과엔터테인먼트',
    '종목코드': '122450',
    '종목명': 'KX',
    '전일대비거래량': 0.48780242947495234
},
{
    'x': 3.43,
    'y': 4,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '복합기업',
    '종목코드': '028260',
    '종목명': '삼성물산',
    '전일대비거래량': 0.6152488739889418
},
{
    'x': 2.32,
    'y': 4,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '복합기업',
    '종목코드': '02826K',
    '종목명': '삼성물산우B',
    '전일대비거래량': 0.3964244521337947
},
{
    'x': 2.17,
    'y': 4,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '복합기업',
    '종목코드': '034730',
    '종목명': 'SK',
    '전일대비거래량': 0.6721659089813818
},
{
    'x': 1.65,
    'y': 4,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '복합기업',
    '종목코드': '001040',
    '종목명': 'CJ',
    '전일대비거래량': 0.6149147856454282
},
{
    'x': 1.31,
    'y': 4,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '복합기업',
    '종목코드': '000880',
    '종목명': '한화',
    '전일대비거래량': 0.4619476056435319
},
{
    'x': 1.03,
    'y': 4,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '복합기업',
    '종목코드': '00104K',
    '종목명': 'CJ4우(전환)',
    '전일대비거래량': 0.2955145118733509
},
{
    'x': 0.58,
    'y': 4,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '복합기업',
    '종목코드': '004990',
    '종목명': '롯데지주',
    '전일대비거래량': 0.3915329656555528
},
{
    'x': 18.25,
    'y': 3,
    'z': 1,
    'color': 'tomato',
    '업종명': '비철금속',
    '종목코드': '128660',
    '종목명': '피제이메탈',
    '전일대비거래량': 192.98325998943847
},
{
    'x': 12.28,
    'y': 3,
    'z': 1,
    'color': 'gold',
    '업종명': '비철금속',
    '종목코드': '025820',
    '종목명': '이구산업',
    '전일대비거래량': 2.3254682131388384
},
{
    'x': 8.99,
    'y': 3,
    'z': 1,
    'color': 'orange',
    '업종명': '비철금속',
    '종목코드': '018470',
    '종목명': '조일알미늄',
    '전일대비거래량': 3.8371952020679463
},
{
    'x': 5.27,
    'y': 3,
    'z': 1,
    'color': 'tomato',
    '업종명': '비철금속',
    '종목코드': '008350',
    '종목명': '남선알미늄',
    '전일대비거래량': 8.110289275914255
},
{
    'x': 4.67,
    'y': 3,
    'z': 1,
    'color': 'tomato',
    '업종명': '비철금속',
    '종목코드': '008355',
    '종목명': '남선알미우',
    '전일대비거래량': 7.631917631917632
},
{
    'x': 4.67,
    'y': 3,
    'z': 1,
    'color': 'gold',
    '업종명': '비철금속',
    '종목코드': '012800',
    '종목명': '대창',
    '전일대비거래량': 2.4220474932395977
},
{
    'x': 3.9,
    'y': 3,
    'z': 1,
    'color': 'orange',
    '업종명': '비철금속',
    '종목코드': '021050',
    '종목명': '서원',
    '전일대비거래량': 3.9027289615930685
},
{
    'x': 3.57,
    'y': 7,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '생명보험',
    '종목코드': '082640',
    '종목명': '동양생명',
    '전일대비거래량': 0.637101255427647
},
{
    'x': 0.86,
    'y': 7,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '생명보험',
    '종목코드': '032830',
    '종목명': '삼성생명',
    '전일대비거래량': 0.4978963812155556
},
{
    'x': 0.38,
    'y': 7,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '생명보험',
    '종목코드': '088350',
    '종목명': '한화생명',
    '전일대비거래량': 0.4722690129927158
},
{
    'x': -0.62,
    'y': 7,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '생명보험',
    '종목코드': '085620',
    '종목명': '미래에셋생명',
    '전일대비거래량': 0.43662504464504565
},
{
    'x': 6.56,
    'y': 15,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '석유와가스',
    '종목코드': '032980',
    '종목명': '바이온',
    '전일대비거래량': 1.313978269863982
},
{
    'x': 5.79,
    'y': 15,
    'z': 1,
    'color': 'gold',
    '업종명': '석유와가스',
    '종목코드': '024060',
    '종목명': '흥구석유',
    '전일대비거래량': 2.411999617479624
},
{
    'x': 2.17,
    'y': 15,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '석유와가스',
    '종목코드': '078930',
    '종목명': 'GS',
    '전일대비거래량': 0.4881572400660059
},
{
    'x': 2.13,
    'y': 15,
    'z': 1,
    'color': 'tomato',
    '업종명': '석유와가스',
    '종목코드': '065420',
    '종목명': '에스아이리소스',
    '전일대비거래량': 50.41986126323476
},
{
    'x': 2.12,
    'y': 15,
    'z': 1,
    'color': 'tomato',
    '업종명': '석유와가스',
    '종목코드': '014530',
    '종목명': '극동유화',
    '전일대비거래량': 9.638028896220389
},
{
    'x': 1.84,
    'y': 15,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '석유와가스',
    '종목코드': '010955',
    '종목명': 'S-Oil우',
    '전일대비거래량': 0.44011311318329477
},
{
    'x': 1.53,
    'y': 15,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '석유와가스',
    '종목코드': '010950',
    '종목명': 'S-Oil',
    '전일대비거래량': 1.2803306800947631
},
{
    'x': 3.39,
    'y': 6,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '손해보험',
    '종목코드': '000370',
    '종목명': '한화손해보험',
    '전일대비거래량': 0.483557154621461
},
{
    'x': 2.95,
    'y': 6,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '손해보험',
    '종목코드': '005830',
    '종목명': 'DB손해보험',
    '전일대비거래량': 0.4293596501065381
},
{
    'x': 1.74,
    'y': 6,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '손해보험',
    '종목코드': '001450',
    '종목명': '현대해상',
    '전일대비거래량': 0.33493127345464846
},
{
    'x': 1.69,
    'y': 6,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '손해보험',
    '종목코드': '000540',
    '종목명': '흥국화재',
    '전일대비거래량': 0.35672473566545343
},
{
    'x': 0.35,
    'y': 6,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '손해보험',
    '종목코드': '000810',
    '종목명': '삼성화재',
    '전일대비거래량': 0.31137935813918327
},
{
    'x': 0.22,
    'y': 6,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '손해보험',
    '종목코드': '000815',
    '종목명': '삼성화재우',
    '전일대비거래량': 0.7283025653320546
},
{
    'x': 0.0,
    'y': 6,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '손해보험',
    '종목코드': '211050',
    '종목명': '인카금융서비스',
    '전일대비거래량': 0.0
},
{
    'x': 5.96,
    'y': 8,
    'z': 1,
    'color': 'tomato',
    '업종명': '식품',
    '종목코드': '005180',
    '종목명': '빙그레',
    '전일대비거래량': 5.8849373123785975
},
{
    'x': 5.48,
    'y': 8,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '식품',
    '종목코드': '900340',
    '종목명': '윙입푸드',
    '전일대비거래량': 1.3210240815882877
},
{
    'x': 3.66,
    'y': 8,
    'z': 1,
    'color': 'gold',
    '업종명': '식품',
    '종목코드': '097950',
    '종목명': 'CJ제일제당',
    '전일대비거래량': 2.5783227002174147
},
{
    'x': 3.64,
    'y': 8,
    'z': 1,
    'color': 'orange',
    '업종명': '식품',
    '종목코드': '218150',
    '종목명': '미래생명자원',
    '전일대비거래량': 3.126011672145333
},
{
    'x': 3.5,
    'y': 8,
    'z': 1,
    'color': 'gold',
    '업종명': '식품',
    '종목코드': '005860',
    '종목명': '한일사료',
    '전일대비거래량': 2.648843151663907
},
{
    'x': 2.87,
    'y': 8,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '식품',
    '종목코드': '008040',
    '종목명': '사조동아원',
    '전일대비거래량': 1.5835888458299088
},
{
    'x': 2.76,
    'y': 8,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '식품',
    '종목코드': '004370',
    '종목명': '농심',
    '전일대비거래량': 0.47370841637283456
},
{
    'x': 1.45,
    'y': 12,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '은행',
    '종목코드': '086790',
    '종목명': '하나금융지주',
    '전일대비거래량': 0.5074935710112652
},
{
    'x': 1.35,
    'y': 12,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '은행',
    '종목코드': '006220',
    '종목명': '제주은행',
    '전일대비거래량': 1.7700083374359497
},
{
    'x': 1.07,
    'y': 12,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '은행',
    '종목코드': '138930',
    '종목명': 'BNK금융지주',
    '전일대비거래량': 0.601454245551397
},
{
    'x': 1.04,
    'y': 12,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '은행',
    '종목코드': '316140',
    '종목명': '우리금융지주',
    '전일대비거래량': 0.5913723523808463
},
{
    'x': 0.87,
    'y': 12,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '은행',
    '종목코드': '139130',
    '종목명': 'DGB금융지주',
    '전일대비거래량': 0.5480758192943337
},
{
    'x': 0.6,
    'y': 12,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '은행',
    '종목코드': '055550',
    '종목명': '신한지주',
    '전일대비거래량': 0.39506376828577566
},
{
    'x': 0.24,
    'y': 12,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '은행',
    '종목코드': '024110',
    '종목명': '기업은행',
    '전일대비거래량': 0.698468568779373
},
{
    'x': 2.57,
    'y': 14,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '음료',
    '종목코드': '276730',
    '종목명': '제주맥주',
    '전일대비거래량': 1.460882451866029
},
{
    'x': 0.95,
    'y': 14,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '음료',
    '종목코드': '000080',
    '종목명': '하이트진로',
    '전일대비거래량': 0.6586863364945557
},
{
    'x': 0.59,
    'y': 14,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '음료',
    '종목코드': '033920',
    '종목명': '무학',
    '전일대비거래량': 1.1743151589888134
},
{
    'x': 0.48,
    'y': 14,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '음료',
    '종목코드': '005300',
    '종목명': '롯데칠성',
    '전일대비거래량': 0.3700787401574803
},
{
    'x': 0.38,
    'y': 14,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '음료',
    '종목코드': '000087',
    '종목명': '하이트진로2우B',
    '전일대비거래량': 0.5782792665726375
},
{
    'x': 0.0,
    'y': 14,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '음료',
    '종목코드': '000890',
    '종목명': '보해양조',
    '전일대비거래량': 1.2939767977317849
},
{
    'x': -0.22,
    'y': 14,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '음료',
    '종목코드': '189980',
    '종목명': '흥국에프엔비',
    '전일대비거래량': 0.8730225893621318
},
{
    'x': 4.64,
    'y': 1,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '자동차',
    '종목코드': '000270',
    '종목명': '기아',
    '전일대비거래량': 1.7795548013868445
},
{
    'x': 2.1,
    'y': 1,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '자동차',
    '종목코드': '005380',
    '종목명': '현대차',
    '전일대비거래량': 0.8980164576881058
},
{
    'x': 1.6,
    'y': 1,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '자동차',
    '종목코드': '005387',
    '종목명': '현대차2우B',
    '전일대비거래량': 0.8757399464945433
},
{
    'x': 1.51,
    'y': 1,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '자동차',
    '종목코드': '005389',
    '종목명': '현대차3우B',
    '전일대비거래량': 1.3566732622710156
},
{
    'x': 1.48,
    'y': 1,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '자동차',
    '종목코드': '005385',
    '종목명': '현대차우',
    '전일대비거래량': 0.9385111416361417
},
{
    'x': 0.83,
    'y': 1,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '자동차',
    '종목코드': '023460',
    '종목명': 'CNH',
    '전일대비거래량': 0.31046839006910676
},
{
    'x': 0.55,
    'y': 1,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '자동차',
    '종목코드': '381970',
    '종목명': '케이카',
    '전일대비거래량': 0.9495627353334143
},
{
    'x': 30.0,
    'y': 16,
    'z': 1,
    'color': 'tomato',
    '업종명': '자동차부품',
    '종목코드': '024900',
    '종목명': '덕양산업',
    '전일대비거래량': 149.22637923753214
},
{
    'x': 8.72,
    'y': 16,
    'z': 1,
    'color': 'tomato',
    '업종명': '자동차부품',
    '종목코드': '145210',
    '종목명': '다이나믹디자인',
    '전일대비거래량': 7.744372192625091
},
{
    'x': 8.23,
    'y': 16,
    'z': 1,
    'color': 'gold',
    '업종명': '자동차부품',
    '종목코드': '004490',
    '종목명': '세방전지',
    '전일대비거래량': 2.9678134166560386
},
{
    'x': 3.82,
    'y': 16,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '자동차부품',
    '종목코드': '123410',
    '종목명': '코리아에프티',
    '전일대비거래량': 1.0579364539885914
},
{
    'x': 3.2,
    'y': 16,
    'z': 1,
    'color': 'gold',
    '업종명': '자동차부품',
    '종목코드': '013310',
    '종목명': '아진산업',
    '전일대비거래량': 2.339791224901999
},
{
    'x': 2.24,
    'y': 16,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '자동차부품',
    '종목코드': '047400',
    '종목명': '유니온머티리얼',
    '전일대비거래량': 0.7233983406038833
},
{
    'x': 1.91,
    'y': 16,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '자동차부품',
    '종목코드': '012200',
    '종목명': '계양전기',
    '전일대비거래량': 0.16371690480465534
},
{
    'x': 3.96,
    'y': 2,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '전기유틸리티',
    '종목코드': '015760',
    '종목명': '한국전력',
    '전일대비거래량': 0.5329110558501071
},
{
    'x': 1.48,
    'y': 2,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '전기유틸리티',
    '종목코드': '051600',
    '종목명': '한전KPS',
    '전일대비거래량': 0.38406688626952945
},
{
    'x': 0.43,
    'y': 2,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '전기유틸리티',
    '종목코드': '130660',
    '종목명': '한전산업',
    '전일대비거래량': 1.020222627867855
},
{
    'x': -0.85,
    'y': 2,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '전기유틸리티',
    '종목코드': '052690',
    '종목명': '한전기술',
    '전일대비거래량': 0.6161474498348575
},
{
    'x': 29.94,
    'y': 9,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '전기장비',
    '종목코드': '006345',
    '종목명': '대원전선우',
    '전일대비거래량': 1.2463873899564961
},
{
    'x': 29.8,
    'y': 9,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '전기장비',
    '종목코드': '024840',
    '종목명': 'KBI메탈',
    '전일대비거래량': 1.9816997590101377
},
{
    'x': 9.01,
    'y': 9,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '전기장비',
    '종목코드': '006340',
    '종목명': '대원전선',
    '전일대비거래량': 0.8524830331964371
},
{
    'x': 7.02,
    'y': 9,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '전기장비',
    '종목코드': '189860',
    '종목명': '서전기전',
    '전일대비거래량': 0.33644924343141797
},
{
    'x': 5.49,
    'y': 9,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '전기장비',
    '종목코드': '199820',
    '종목명': '제일전기공업',
    '전일대비거래량': 0.3167727623106095
},
{
    'x': 4.91,
    'y': 9,
    'z': 1,
    'color': 'tomato',
    '업종명': '전기장비',
    '종목코드': '126340',
    '종목명': '비나텍',
    '전일대비거래량': 4.859675542473817
},
{
    'x': 3.63,
    'y': 9,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '전기장비',
    '종목코드': '017510',
    '종목명': '세명전기',
    '전일대비거래량': 0.14476597704497232
},
{
    'x': 8.43,
    'y': 5,
    'z': 1,
    'color': 'tomato',
    '업종명': '조선',
    '종목코드': '082740',
    '종목명': '한화엔진',
    '전일대비거래량': 5.391148754019193
},
{
    'x': 4.39,
    'y': 5,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '조선',
    '종목코드': '073010',
    '종목명': '케이에스피',
    '전일대비거래량': 1.9156426494743037
},
{
    'x': 3.73,
    'y': 5,
    'z': 1,
    'color': 'orange',
    '업종명': '조선',
    '종목코드': '077970',
    '종목명': 'STX엔진',
    '전일대비거래량': 3.2135263744051836
},
{
    'x': 3.51,
    'y': 5,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '조선',
    '종목코드': '042660',
    '종목명': '한화오션',
    '전일대비거래량': 0.8817256535985268
},
{
    'x': 1.82,
    'y': 5,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '조선',
    '종목코드': '099410',
    '종목명': '동방선기',
    '전일대비거래량': 0.7992758969783283
},
{
    'x': 1.46,
    'y': 5,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '조선',
    '종목코드': '092460',
    '종목명': '한라IMS',
    '전일대비거래량': 0.34804966762824535
},
{
    'x': 1.29,
    'y': 5,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '조선',
    '종목코드': '054180',
    '종목명': '메디콕스',
    '전일대비거래량': 0.44696147292896327
},
{
    'x': 3.52,
    'y': 22,
    'z': 1,
    'color': 'tomato',
    '업종명': '증권',
    '종목코드': '064820',
    '종목명': '케이프',
    '전일대비거래량': 4.296970658207772
},
{
    'x': 3.4,
    'y': 22,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '증권',
    '종목코드': '039490',
    '종목명': '키움증권',
    '전일대비거래량': 1.1428811443932412
},
{
    'x': 2.43,
    'y': 22,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '증권',
    '종목코드': '001515',
    '종목명': 'SK증권우',
    '전일대비거래량': 0.12979971229390283
},
{
    'x': 0.87,
    'y': 22,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '증권',
    '종목코드': '023590',
    '종목명': '다우기술',
    '전일대비거래량': 0.1887265582784046
},
{
    'x': 0.8,
    'y': 22,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '증권',
    '종목코드': '071050',
    '종목명': '한국금융지주',
    '전일대비거래량': 0.419729584233809
},
{
    'x': 0.73,
    'y': 22,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '증권',
    '종목코드': '030610',
    '종목명': '교보증권',
    '전일대비거래량': 0.2732643162238471
},
{
    'x': 0.7,
    'y': 22,
    'z': 1,
    'color': 'gold',
    '업종명': '증권',
    '종목코드': '001755',
    '종목명': '한양증권우',
    '전일대비거래량': 2.425
},
{
    'x': 0.96,
    'y': 11,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '항공화물운송과물류',
    '종목코드': '004365',
    '종목명': '세방우',
    '전일대비거래량': 0.4849327770050997
},
{
    'x': 0.87,
    'y': 11,
    'z': 1,
    'color': 'tomato',
    '업종명': '항공화물운송과물류',
    '종목코드': '004140',
    '종목명': '동방',
    '전일대비거래량': 4.398275370848298
},
{
    'x': 0.76,
    'y': 11,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '항공화물운송과물류',
    '종목코드': '000120',
    '종목명': 'CJ대한통운',
    '전일대비거래량': 0.7279719598870606
},
{
    'x': 0.46,
    'y': 11,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '항공화물운송과물류',
    '종목코드': '086280',
    '종목명': '현대글로비스',
    '전일대비거래량': 0.8050899800668183
},
{
    'x': 0.18,
    'y': 11,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '항공화물운송과물류',
    '종목코드': '004360',
    '종목명': '세방',
    '전일대비거래량': 0.503619361079915
},
{
    'x': 0.0,
    'y': 11,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '항공화물운송과물류',
    '종목코드': '001140',
    '종목명': '국보',
    '전일대비거래량': 0.0
},
{
    'x': -0.22,
    'y': 11,
    'z': 1,
    'color': 'orange',
    '업종명': '항공화물운송과물류',
    '종목코드': '009180',
    '종목명': '한솔로지스틱스',
    '전일대비거래량': 3.4270805399123985
},
{
    'x': 1.36,
    'y': 10,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '해운사',
    '종목코드': '028670',
    '종목명': '팬오션',
    '전일대비거래량': 0.8680344563675204
},
{
    'x': 0.98,
    'y': 10,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '해운사',
    '종목코드': '011200',
    '종목명': 'HMM',
    '전일대비거래량': 0.7337801172722453
},
{
    'x': 0.69,
    'y': 10,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '해운사',
    '종목코드': '005880',
    '종목명': '대한해운',
    '전일대비거래량': 1.5896711040121314
},
{
    'x': 0.59,
    'y': 10,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '해운사',
    '종목코드': '067900',
    '종목명': '와이엔텍',
    '전일대비거래량': 0.6682318127259963
},
{
    'x': 0.0,
    'y': 10,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '해운사',
    '종목코드': '010600',
    '종목명': '웰바이오텍',
    '전일대비거래량': 0.0
},
{
    'x': -0.43,
    'y': 10,
    'z': 1,
    'color': 'dodgerblue',
    '업종명': '해운사',
    '종목코드': '129260',
    '종목명': '인터지스',
    '전일대비거래량': 0.7221231174148267
},
{
    'x': -0.75,
    'y': 10,
    'z': 1,
    'color': 'Lawngreen',
    '업종명': '해운사',
    '종목코드': '054300',
    '종목명': '팬스타엔터프라이즈',
    '전일대비거래량': 1.181800965817631
}]